#include <stdio.h>

int main()
{

    long long int eye, face, body;
    scanf("%lld %lld %lld", &eye, &face, &body);
    long long int doll = 0;
    long long int x;

    if(eye<=face && eye<=body)
        x = eye;
    else if(face<=eye && face<=body)
        x = face;
    else
        x = body;

    doll += x;
    eye -= x;
    face -= x;
    body -= x;

    if(eye/2 < body)
        doll+= eye/2;
    else
        doll+=body;

    printf("%lld\n", doll);
    return 0;
}

/*
যেই ৩ টা ওয়েতে মুর্তি বানানো যায় সেগুলো ব্যবহার করে যদি আমরা মুর্তি বানাতে চাই তাহলে দেখা যাবে যে শুধুমাত্র ১ এবং ৩ নাম্বার ওয়েতে আগানো আমাদের জন্য লাভজনক কিন্তু ২ নাম্বার ওয়ে লাভজনক নয় কারণ আমাদের কাছে অলরেডি ৩ নাম্বার অপশন রয়েছে যেটা আমাদের জন্য বেটার

এখন চিন্তা করুন ইনপুট হিসেবে আমাদের কাছে ৮ টা চোখ ৩ টা মুখ এবং ৬ টা বডি আছে
তাহলে শুরুতে আমরা ৩ নাম্বার ওয়েতে গাবো কারণ এখানে সবগুলো ১ টা করে লাগবে তাহলে
৮ ৩ ৬ এই ইনপুট দিয়ে ৩ নাম্বার ওয়েতে মুর্তি বানানো যাবে কয়টা যদি চিন্তা করেন তাহলে দেখবেন ৩ টাই বানানো সম্ভব অর্থাৎ ৩ টা ভ্যালুর মধ্যে যেটা মিনিমাম সেই সংখ্যক বানানো সম্ভব তাহলে এটাকে আমরা এন্সার হিসেবে রেখে দেই
ans = 3

এখন যেহেতু ৩ টা বানানো হয়ে গেছে তাহলে সবগুলো ভ্যালু ৩ করে কমে যাবে অর্থাত
৮ - ৩ = ৫ টি চোখ
৩ - ৩ = ০ টি মুখ
৬ - ৩ = ৩ টি বডি অবশিষ্ট আছে

এখন আমরা দেখবো এগুলো দিয়ে ১ নাম্বার ওয়েতে কয়টা মুর্তি বানানো যায়। যেহেতু এই ওয়েতে ২ টা করে চোখ এবং ১ টা করে বডি লাগবে তাহলে আমরা বলতে পারই ১ জোড়া চোখ এবং ১ টা বডি

তাহলে চোখকে আমরা এইভাবে জোড়া বানাতে পারি:
৫/২ = ২ জোড়া চোখ এবং ৩ টা বডি এদের মধ্যে মিনিমাম যা সেই কয়টা মুর্তিই আমরা বানাতে পারব তাহলে এন্সার এর সাথে মিনিমাম অর্থাৎ ২ আমরা যোগ করে দিলে পাবো ৩ + ২ = ৫ এবং এই ৫ ই আমাদের এন্সার
*/